HELYXcore-4.4.0/examples/legacy/combustion/XiDyMFoam/oscillatingCylinder/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    "(walls|cylinder)"
    {
        type            epsilonWallFunction;
        value           uniform 100;
    }
    "inlet.*"
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.001;
        value           uniform 100;
    }
    outlet
    {
        type           inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
