HELYXcore-4.4.0/examples/legacy/combustion/XiDyMFoam/oscillatingCylinder/0/pointDisplacementy
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      pointDisplacementy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           $internalField;
    }
    cylinder
    {
        type            codedFixedValue;
        redirectType    pointDisplacementy_cylinder;
        code
        #{
            const scalar t = this->db().time().value();
            const scalar a = 0.001;
            const scalar f = 200;
            forceAssign(a*sin(constant::mathematical::twoPi*f*t));
        #};
        value           $internalField;
    }
    "inlet.*"
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
